nova/DATA/DATA/rw/fio_output_128G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 131072MiB) test: (groupid=0, jobs=1): err= 0: pid=3202252: Mon Oct 14 20:00:32 2024 write: IOPS=79.8k, BW=312MiB/s (327MB/s)(128GiB/420621msec); 0 zone resets clat (usec): min=2, max=228633, avg=12.12, stdev=1035.83 lat (usec): min=2, max=228633, avg=12.16, stdev=1035.83 clat percentiles (nsec): | 1.00th=[ 3440], 5.00th=[ 3664], 10.00th=[ 3792], 20.00th=[ 3952], | 30.00th=[ 4128], 40.00th=[ 4320], 50.00th=[ 4640], 60.00th=[ 5344], | 70.00th=[ 5664], 80.00th=[ 5984], 90.00th=[ 6752], 95.00th=[ 7264], | 99.00th=[ 8384], 99.50th=[ 9024], 99.90th=[20864], 99.95th=[22144], | 99.99th=[24448] bw ( KiB/s): min=129024, max=742320, per=100.00%, avg=319345.48, stdev=122429.77, samples=840 iops : min=32256, max=185580, avg=79836.36, stdev=30607.45, samples=840 lat (usec) : 4=22.40%, 10=77.21%, 20=0.25%, 50=0.14%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% lat (msec) : 100=0.01%, 250=0.01% cpu : usr=3.12%, sys=96.85%, ctx=149, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,33554432,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=312MiB/s (327MB/s), 312MiB/s-312MiB/s (327MB/s-327MB/s), io=128GiB (137GB), run=420621-420621msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%