nova/DATA/DATA/rw/fio_output_16G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 16384MiB) test: (groupid=0, jobs=1): err= 0: pid=3194775: Mon Oct 14 19:49:52 2024 write: IOPS=163k, BW=637MiB/s (668MB/s)(16.0GiB/25718msec); 0 zone resets clat (usec): min=2, max=28627, avg= 5.73, stdev=129.33 lat (usec): min=2, max=28627, avg= 5.77, stdev=129.33 clat percentiles (nsec): | 1.00th=[ 3280], 5.00th=[ 3472], 10.00th=[ 3600], 20.00th=[ 3760], | 30.00th=[ 3952], 40.00th=[ 4128], 50.00th=[ 4384], 60.00th=[ 4960], | 70.00th=[ 5472], 80.00th=[ 5856], 90.00th=[ 6560], 95.00th=[ 7200], | 99.00th=[ 8256], 99.50th=[ 8768], 99.90th=[20608], 99.95th=[22144], | 99.99th=[24704] bw ( KiB/s): min=554832, max=770376, per=100.00%, avg=653368.63, stdev=60215.77, samples=51 iops : min=138708, max=192596, avg=163342.27, stdev=15053.96, samples=51 lat (usec) : 4=33.42%, 10=66.21%, 20=0.23%, 50=0.13%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% cpu : usr=6.06%, sys=93.92%, ctx=13, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,4194304,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=637MiB/s (668MB/s), 637MiB/s-637MiB/s (668MB/s-668MB/s), io=16.0GiB (17.2GB), run=25718-25718msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%