nova/DATA/DATA/rw/fio_output_1G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=3188106: Mon Oct 14 19:48:56 2024 write: IOPS=198k, BW=773MiB/s (811MB/s)(1024MiB/1324msec); 0 zone resets clat (usec): min=2, max=863, avg= 4.66, stdev= 4.81 lat (usec): min=2, max=863, avg= 4.70, stdev= 4.81 clat percentiles (nsec): | 1.00th=[ 3120], 5.00th=[ 3312], 10.00th=[ 3408], 20.00th=[ 3600], | 30.00th=[ 3728], 40.00th=[ 3920], 50.00th=[ 4128], 60.00th=[ 4640], | 70.00th=[ 5152], 80.00th=[ 5600], 90.00th=[ 6304], 95.00th=[ 6944], | 99.00th=[ 8032], 99.50th=[ 8512], 99.90th=[19840], 99.95th=[21632], | 99.99th=[24192] bw ( KiB/s): min=776248, max=802128, per=99.65%, avg=789188.00, stdev=18299.92, samples=2 iops : min=194062, max=200532, avg=197297.00, stdev=4574.98, samples=2 lat (usec) : 4=44.70%, 10=54.97%, 20=0.23%, 50=0.09%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% cpu : usr=9.90%, sys=90.02%, ctx=3, majf=0, minf=10 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=773MiB/s (811MB/s), 773MiB/s-773MiB/s (811MB/s-811MB/s), io=1024MiB (1074MB), run=1324-1324msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%