nova/DATA/DATA/rw/fio_output_32G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 32768MiB) test: (groupid=0, jobs=1): err= 0: pid=3197353: Mon Oct 14 19:50:55 2024 write: IOPS=140k, BW=548MiB/s (574MB/s)(32.0GiB/59841msec); 0 zone resets clat (usec): min=2, max=56320, avg= 6.76, stdev=257.06 lat (usec): min=2, max=56320, avg= 6.80, stdev=257.06 clat percentiles (nsec): | 1.00th=[ 3312], 5.00th=[ 3536], 10.00th=[ 3664], 20.00th=[ 3856], | 30.00th=[ 4048], 40.00th=[ 4256], 50.00th=[ 4576], 60.00th=[ 5280], | 70.00th=[ 5664], 80.00th=[ 6048], 90.00th=[ 6752], 95.00th=[ 7328], | 99.00th=[ 8256], 99.50th=[ 8896], 99.90th=[20864], 99.95th=[22144], | 99.99th=[24448] bw ( KiB/s): min=421368, max=746216, per=100.00%, avg=561633.75, stdev=84333.42, samples=119 iops : min=105342, max=186554, avg=140408.45, stdev=21083.35, samples=119 lat (usec) : 4=27.86%, 10=71.76%, 20=0.24%, 50=0.13%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% lat (msec) : 100=0.01% cpu : usr=5.01%, sys=94.97%, ctx=25, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,8388608,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=548MiB/s (574MB/s), 548MiB/s-548MiB/s (574MB/s-574MB/s), io=32.0GiB (34.4GB), run=59841-59841msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%