nova/DATA/DATA/rw/fio_output_64G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 65536MiB) test: (groupid=0, jobs=1): err= 0: pid=3200073: Mon Oct 14 19:53:29 2024 write: IOPS=112k, BW=436MiB/s (458MB/s)(64.0GiB/150197msec); 0 zone resets clat (usec): min=2, max=115493, avg= 8.55, stdev=521.30 lat (usec): min=2, max=115493, avg= 8.59, stdev=521.30 clat percentiles (nsec): | 1.00th=[ 3344], 5.00th=[ 3536], 10.00th=[ 3664], 20.00th=[ 3888], | 30.00th=[ 4048], 40.00th=[ 4256], 50.00th=[ 4512], 60.00th=[ 5216], | 70.00th=[ 5600], 80.00th=[ 6048], 90.00th=[ 6688], 95.00th=[ 7392], | 99.00th=[ 8384], 99.50th=[ 8896], 99.90th=[20864], 99.95th=[22400], | 99.99th=[24704] bw ( KiB/s): min=258048, max=766776, per=100.00%, avg=447283.04, stdev=115910.24, samples=300 iops : min=64512, max=191696, avg=111820.78, stdev=28977.57, samples=300 lat (usec) : 4=26.99%, 10=72.62%, 20=0.23%, 50=0.14%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01% lat (msec) : 100=0.01%, 250=0.01% cpu : usr=4.34%, sys=95.63%, ctx=55, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,16777216,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=436MiB/s (458MB/s), 436MiB/s-436MiB/s (458MB/s-458MB/s), io=64.0GiB (68.7GB), run=150197-150197msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%