nova/DATA/DATA/rw/fio_output_8G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 8192MiB) test: (groupid=0, jobs=1): err= 0: pid=3192760: Mon Oct 14 19:49:24 2024 write: IOPS=174k, BW=680MiB/s (713MB/s)(8192MiB/12051msec); 0 zone resets clat (usec): min=2, max=13390, avg= 5.37, stdev=61.48 lat (usec): min=2, max=13390, avg= 5.41, stdev=61.48 clat percentiles (nsec): | 1.00th=[ 3248], 5.00th=[ 3440], 10.00th=[ 3600], 20.00th=[ 3792], | 30.00th=[ 3984], 40.00th=[ 4192], 50.00th=[ 4512], 60.00th=[ 5152], | 70.00th=[ 5536], 80.00th=[ 6048], 90.00th=[ 6752], 95.00th=[ 7392], | 99.00th=[ 8256], 99.50th=[ 8768], 99.90th=[20608], 99.95th=[22144], | 99.99th=[24192] bw ( KiB/s): min=630912, max=774144, per=100.00%, avg=697183.67, stdev=48176.38, samples=24 iops : min=157728, max=193536, avg=174295.83, stdev=12044.10, samples=24 lat (usec) : 4=31.49%, 10=68.14%, 20=0.25%, 50=0.12%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01% lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01% cpu : usr=5.77%, sys=94.21%, ctx=5, majf=0, minf=13 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=680MiB/s (713MB/s), 680MiB/s-680MiB/s (713MB/s-713MB/s), io=8192MiB (8590MB), run=12051-12051msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%